УТ.РасширениеКонтурЛогистика/src/Documents/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</name>
  <posting>Deny</posting>
  <attributes>
    <name>ЗаказЗаявкаОснование</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТрН</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТрН</name>
    <comment>Дата документа транспортная накладная.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>Юр лицо, предоставляющее груз к перевозке, отправитель докуметна(Титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Юр. лицо, осуществляющее перевозку, получатель этого Документа(титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>Юр лицо - получатель груза (необязательно покупатель по договору)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство на котором начинает исполняться перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВодителя</name>
    <comment>приоритетнее чем указанный у водителя. телефоны могут закрепляться за ТС!</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <comment>Место погрузки и начала перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <comment>Место где заканчивается перевозка</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомЗак</name>
    <comment>Дата заказа (заявки) на транспорт</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗак</name>
    <comment>Дата заказа (заявки) на транспорт</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкуОсуществляет</name>
    <comment>Организация, выполняющая погрузку груза в транспортное средство (указывается если не равна Грузоотправителю)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкуОсуществляетПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку</name>
    <comment>Признак что файл должен отправляться из ящика лица, осуществляющего погрузку</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкаДоговор</name>
    <comment>Договор с Организацией, осуществл. погрузку (обязателен если указана Организация осуществляющая погрузку)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкаСотрудник</name>
    <comment>Сотрудник организации выполняющей погрузку (обязателен если указана Организация осуществляющая погрузку)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <comment>Обязателен если тип основного транспортного средства - тягач</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <comment>Второй прицеп автопоезда</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <comment>Срок доставки произвольным текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяДоставки</name>
    <comment>Дата и время доставки в часовом поясе пользователя формирующего документ</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутТекст</name>
    <comment>Текстовое описание маршрута</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <comment>Машиночитаемое описание маршрута для автоматической идентификации</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриПогрузке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриВыгрузке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЭкспедиция</name>
    <comment>Признак того что Заказчик перевозки не является грузоотправителем (истина)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедицияЗаказчик</name>
    <comment>Укажите заказчика услуг, связанных с перевозкой груза. (Грузоотправителем в этом случае является экспедитор)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедицияДоговор</name>
    <comment>Договор на выполнение услуг по организации перевозки груза (договор экспедиции)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратМесто</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресовкаИсходноеМестоДоставки</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратПолучатель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресовкаИсходныйПолучатель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПереадресовок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменВодителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
      <types>EnumRef.КонтурЛогистика_УровниДоступаСотрудника</types>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>Boolean</types>
      <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.Пользователи</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
      <types>CatalogRef.Склады</types>
      <types>EnumRef.КонтурЛогистика_ИнициаторыПереадресовки</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаQRКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерГрузоотправитель</name>
    <comment>надсущность над контрагентами/организациями</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерПеревозчик</name>
    <comment>надсущность над контрагентами, например, ТК Монополия</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерГрузополучатель</name>
    <comment>надсущность над контрагентами, например, ТС Магнит</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
</mdclass:Document>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Documents/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id       = ДанныеЗаполнения.kl_id;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда 
			
			КС = КонтурЛогистика_КонструкторыXDTO;
			СодИнфГО 	= XDTO.Документ.СодИнфГО;
			
			УИД_ТрН_ИзПула = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "УИД_ТрН"); // мог быть отправлен "из пула", тогда он есть сразу в Т1 
			Если ЗначениеЗаполнено(УИД_ТрН_ИзПула) Тогда 
				УИД = УИД_ТрН_ИзПула;
			КонецЕсли;
			
			НомерТрН 	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомерТрН");
			ДатаТрН_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаТрН");
			ДатаТрН     = КС.Конвертировать_ДатаТип_вДата(ДатаТрН_raw);
			НомЗак 		= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомЗак");
			ДатаЗак_raw	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаЗак");
			ДатаЗак     = КС.Конвертировать_ДатаТип_вДата(ДатаЗак_raw);
			ГОЭксп = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГО, "ГОЭксп");
			ЭтоЭкспедиция = ГОЭксп = "1";
			
			// если указана эл. заказ (заявка) то найти её
			ИдЗак =  КС.XDTO_Вычислить(СодИнфГО, "ИдЗак");
			Если ИдЗак <> Неопределено Тогда 
				ИдФайлЗак = КС.XDTO_ПолучитьЗначениеСвойства(ИдЗак, "ИдФайлЗак")
			КонецЕсли;                                                         
			НайденныйФайлЗЗ = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлОбменаПоИмениФайла(ИдФайлЗак);
			Если ЗначениеЗаполнено(НайденныйФайлЗЗ) Тогда 
				ЗаказЗаявкаОснование = НайденныйФайлЗЗ.ГлавныйДокумент;
			КонецЕсли;
			
			ИдентификаторыУчастниковЭДО = КонтурЛогистика_КонструкторыXDTO.ИдентификаторыСторонИзИмениФайлаТитулаТРН(ДанныеЗаполнения.ИмяФайла);
			
			Грузоотправитель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
				КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГО, "РекИдентГО"), ИдентификаторыУчастниковЭДО.Грузоотправитель);
			Перевозчик 			= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
				КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "СвПер"), ИдентификаторыУчастниковЭДО.Грузоперевозчик);
				
			СвГП = КС.XDTO_Вычислить(СодИнфГО, "СвГП");
			Если СвГП <> Неопределено Тогда // в черновике может не быть ГП
				Грузополучатель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
												КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГП, "РекИдентГП"), ИдентификаторыУчастниковЭДО.Грузополучатель);
				МестоДоставки  		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СвГП, "АдресДостГр"));
			КонецЕсли;
			
			Если ЭтоЭкспедиция Тогда 
				ЭкспедицияЗаказчик = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвЗак, "РекИдентЗак"));
				ДогУслПерXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвЗак.ДогУслПер");
				ЭкспедицияДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ДогУслПерXDTO);
			КонецЕсли;
			
			СвТС = КС.XDTO_Вычислить(СодИнфГО, "СвТС");
			Если СвТС <> Неопределено Тогда // в черновике может не быть ТС
				ТранспортноеСредство = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "ТС"));
				ПрицепыXDTOМассив = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "Прицеп"));
				Если ПрицепыXDTOМассив <> Неопределено Тогда
					КоличествоПрицепов = ПрицепыXDTOМассив.Количество();
					
					Если КоличествоПрицепов > 0 Тогда
						Прицеп = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[0]);
						
						Если КоличествоПрицепов > 1 Тогда
							Прицеп2 = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[1]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СвПогруз = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз");
			Если СвПогруз <> Неопределено Тогда // в черновике может не быть места погрузки
				МестоПогрузки  		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(
					КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ФАдресПогр"), КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ВладИнфр"));
			КонецЕсли;
			
			СвВодит = КС.XDTO_Вычислить(СодИнфГО, "СвВодит");
			Если СвВодит <> Неопределено Тогда // в черновике может не быть водителя
				
				СвВодитМассив = КС.XDTO_ВычислитьМассивXDTO(СвВодит);				
				Если СвВодитМассив <> Неопределено И СвВодитМассив.Количество() > 0 Тогда
					
					Тлф = КС.XDTO_Вычислить(СвВодитМассив[0], "Тлф");
					Если Тлф <> Неопределено Тогда
						
						ТлфМассив = КС.XDTO_ВычислитьМассивXDTO(Тлф);						
						Если ТлфМассив <> Неопределено И ТлфМассив.Количество() > 0 Тогда
							ТелефонВодителя = ТлфМассив[0];
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ГрузоотправительПодразделение = ДанныеЗаполнения.ОтправительПодразделение;
			ГрузополучательПодразделение = ДанныеЗаполнения.ПолучательПодразделение;
			// ПеревозчикПодразделение = эмм, а откуда брать?  TODO
			
			СвЛицПогрГр_СовпГОП = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.СовпГОП");
			Если СвЛицПогрГр_СовпГОП = "1" Тогда
				
				ПогрузкуОсуществляет = Грузоотправитель;
				
			Иначе
				
				ПогрузкуОсуществляет = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РекЛицПогрГр"), 
						ИдентификаторыУчастниковЭДО.Грузоотправитель, 
						Истина);
				
				Если ДанныеЗаполнения.Отправитель = ПогрузкуОсуществляет Тогда 
					ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ОснПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.ОснПогрГр");
			ПогрузкаДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ОснПогрГрXDTO);
			
			РабЛицПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РабЛицПогрГр");
			ПогрузкаСотрудник    = КС.Конвертировать_РабЛицПогрГр_вСотрудникаЛогистика(РабЛицПогрГрXDTO);
			
			СрокДоставки		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.СрокДостГр");
			ДатаВремяДоставкиRAW= КС.XDTO_Вычислить(СодИнфГО, "УказГО.ДатВрДостГр");
			Если ЗначениеЗаполнено(ДатаВремяДоставкиRAW) Тогда 
            	ДатаВремяДоставки	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатаВремяДоставкиRAW);
			КонецЕсли;
			
			МаршрутТекст		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршТекст");
			МаршрутМашиночитаемый = КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршМашЧит");
			
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда 
			
		Иначе
			 Сообщить("Обработка заполнения Документа ЭТРН из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		Если Не ЗначениеЗаполнено(ГрузоотправительПодразделение) И ЗначениеЗаполнено(Грузоотправитель) Тогда
			ГрузоотправительПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузоотправитель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПеревозчикПодразделение) И ЗначениеЗаполнено(Перевозчик) Тогда
			ПеревозчикПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Перевозчик, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ГрузополучательПодразделение) И ЗначениеЗаполнено(Грузополучатель) Тогда
			ГрузополучательПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузополучатель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПогрузкуОсуществляетПодразделение) И ЗначениеЗаполнено(ПогрузкуОсуществляет) Тогда
			ПогрузкуОсуществляетПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(ПогрузкуОсуществляет, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьПартнераГО()

	Если ЗначениеЗаполнено(Грузоотправитель) Тогда 
		ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузоотправитель);
	Иначе
		ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераПВ()

	Если ЗначениеЗаполнено(Перевозчик) Тогда 
		ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Перевозчик);
	Иначе
		ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераГП()

	Если ЗначениеЗаполнено(Грузополучатель) Тогда 
		ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузополучатель);
	Иначе
		ПартнерГрузополучатель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
